jmh8231-Dev/desmosat-fw-2023/CustomModule(B)/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CustomB_Debug_L1_Pin GPIO_PIN_13
#define CustomB_Debug_L1_GPIO_Port GPIOC
#define CustomB_Debug_L2_Pin GPIO_PIN_14
#define CustomB_Debug_L2_GPIO_Port GPIOC
#define CustomB_GPIO_Pin GPIO_PIN_0
#define CustomB_GPIO_GPIO_Port GPIOA
#define GDK101_Rx_Pin GPIO_PIN_2
#define GDK101_Rx_GPIO_Port GPIOA
#define GDK101_Tx_Pin GPIO_PIN_3
#define GDK101_Tx_GPIO_Port GPIOA
#define CustomB_Debug_Tx_Pin GPIO_PIN_9
#define CustomB_Debug_Tx_GPIO_Port GPIOA
#define CustomB_Debug_Rx_Pin GPIO_PIN_10
#define CustomB_Debug_Rx_GPIO_Port GPIOA
#define GDK101_SCL_Pin GPIO_PIN_6
#define GDK101_SCL_GPIO_Port GPIOB
#define GDK101_SDA_Pin GPIO_PIN_7
#define GDK101_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
